-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2025-01-04 10:55:13
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `kasugai_kyudo`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `m_area_group`
--

CREATE TABLE `m_area_group` (
  `area_group_id` int(11) NOT NULL,
  `area_group_name` varchar(16) NOT NULL COMMENT '地区名',
  `teiki_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '定期審査フラグ',
  `chuou_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '中央審査フラグ',
  `rengou_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '連合審査フラグ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_area_group`
--

INSERT INTO `m_area_group` (`area_group_id`, `area_group_name`, `teiki_flg`, `chuou_flg`, `rengou_flg`) VALUES
(1, '仙台', 1, 1, 0),
(2, '東京', 1, 1, 0),
(3, '名古屋', 1, 1, 0),
(4, '京都', 1, 1, 0),
(5, '福岡', 1, 1, 0),
(6, '北海道地区', 0, 1, 1),
(7, '東北地区', 0, 1, 1),
(8, '関東地区', 0, 1, 1),
(9, '北信越地区', 0, 1, 1),
(10, '東海地区', 0, 1, 1),
(11, '近畿地区', 0, 1, 1),
(12, '中国地区', 0, 1, 1),
(13, '四国地区', 0, 1, 1),
(14, '九州地区', 0, 1, 1),
(15, '都城', 0, 1, 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_category`
--

CREATE TABLE `m_category` (
  `category_id` int(11) NOT NULL,
  `category_name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_category`
--

INSERT INTO `m_category` (`category_id`, `category_name`) VALUES
(1, '協会主催'),
(2, '全弓連'),
(3, '愛弓連'),
(4, '東海連合'),
(5, '中央審査'),
(6, '連合審査'),
(7, '地方審査'),
(8, 'その他');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_fiscal_year`
--

CREATE TABLE `m_fiscal_year` (
  `fiscal_year_id` int(11) NOT NULL,
  `year` year(4) NOT NULL,
  `wareki` varchar(8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_fiscal_year`
--

INSERT INTO `m_fiscal_year` (`fiscal_year_id`, `year`, `wareki`) VALUES
(1, '2001', '平成13年度'),
(2, '2002', '平成14年度'),
(3, '2003', '平成15年度'),
(4, '2004', '平成16年度'),
(5, '2005', '平成17年度'),
(6, '2006', '平成18年度'),
(7, '2007', '平成19年度'),
(8, '2008', '平成20年度'),
(9, '2009', '平成21年度'),
(10, '2010', '平成22年度'),
(11, '2011', '平成23年度'),
(12, '2012', '平成24年度'),
(13, '2013', '平成25年度'),
(14, '2014', '平成26年度'),
(15, '2015', '平成27年度'),
(16, '2016', '平成28年度'),
(17, '2017', '平成29年度'),
(18, '2018', '平成30年度'),
(19, '2019', '令和1年度'),
(20, '2020', '令和2年度'),
(21, '2021', '令和3年度'),
(22, '2022', '令和4年度'),
(23, '2023', '令和5年度'),
(24, '2024', '令和6年度'),
(25, '2025', '令和7年度'),
(26, '2026', '令和8年度'),
(27, '2027', '令和9年度'),
(28, '2028', '令和10年度'),
(29, '2029', '令和11年度'),
(30, '2030', '令和12年度');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_grade`
--

CREATE TABLE `m_grade` (
  `grade_id` int(11) NOT NULL,
  `grade_name` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `order_no` int(11) NOT NULL,
  `calc` int(11) NOT NULL COMMENT '名簿計算数'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_grade`
--

INSERT INTO `m_grade` (`grade_id`, `grade_name`, `order_no`, `calc`) VALUES
(0, '無指定', 99, 99),
(1, '十段', 1, 1),
(2, '九段', 2, 2),
(3, '八段', 3, 3),
(4, '七段', 4, 4),
(5, '六段', 5, 5),
(6, '五段', 6, 6),
(7, '四段', 7, 7),
(8, '参段', 8, 8),
(9, '弐段', 9, 9),
(10, '初段', 10, 10),
(11, '１級', 11, 11),
(12, '２級', 12, 12),
(13, '３級', 13, 13),
(14, '４級', 14, 14),
(15, '５級', 15, 15);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_grade_group`
--

CREATE TABLE `m_grade_group` (
  `grade_group_id` int(11) NOT NULL,
  `grade_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_grade_group`
--

INSERT INTO `m_grade_group` (`grade_group_id`, `grade_id`) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8),
(9, 9),
(10, 10),
(11, 3),
(11, 4),
(11, 5),
(11, 6),
(12, 3),
(12, 4),
(12, 5),
(13, 3),
(13, 4),
(14, 3),
(14, 5),
(15, 4),
(15, 5),
(15, 6),
(16, 4),
(16, 5),
(17, 5),
(17, 6),
(18, 6),
(18, 7),
(19, 6),
(19, 7),
(19, 8),
(20, 7),
(20, 8),
(20, 9),
(20, 10),
(21, 7),
(21, 8),
(21, 9),
(22, 7),
(22, 8),
(23, 8),
(23, 9),
(23, 10),
(24, 8),
(24, 9),
(24, 10),
(25, 9),
(25, 10),
(26, 1),
(26, 2),
(26, 3),
(26, 4),
(26, 5),
(26, 6),
(26, 7),
(27, 1),
(27, 2),
(27, 3),
(27, 4),
(27, 5),
(27, 6),
(27, 7),
(27, 8),
(28, 8),
(28, 9),
(28, 10),
(28, 11),
(28, 12),
(28, 13),
(28, 14),
(28, 15),
(29, 6),
(29, 7),
(29, 8),
(29, 9),
(29, 10),
(29, 11),
(29, 12),
(29, 13),
(29, 14),
(29, 15),
(30, 7),
(30, 8),
(30, 9),
(30, 10),
(30, 11),
(30, 12),
(30, 13),
(30, 14),
(30, 15),
(31, 5),
(31, 6),
(31, 7),
(31, 8),
(31, 9),
(31, 10),
(32, 6),
(32, 7),
(32, 8),
(32, 9),
(32, 10);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_holder`
--

CREATE TABLE `m_holder` (
  `holder_id` int(11) NOT NULL,
  `holder_name` varchar(4) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `order_no` int(11) NOT NULL,
  `calc` int(11) NOT NULL COMMENT '名簿計算数',
  `view_flg` tinyint(1) NOT NULL COMMENT '表示フラグ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_holder`
--

INSERT INTO `m_holder` (`holder_id`, `holder_name`, `order_no`, `calc`, `view_flg`) VALUES
(0, '', 99, 900, 0),
(1, '範士', 1, 100, 1),
(2, '教士', 2, 200, 1),
(3, '錬士', 3, 300, 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_holder_grade`
--

CREATE TABLE `m_holder_grade` (
  `holder_grade_id` int(11) NOT NULL,
  `holder_grade_name` varchar(64) NOT NULL,
  `holder_grade_name_short` varchar(16) NOT NULL,
  `holder_group_id` int(11) NOT NULL,
  `grade_group_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_holder_grade`
--

INSERT INTO `m_holder_grade` (`holder_grade_id`, `holder_grade_name`, `holder_grade_name_short`, `holder_group_id`, `grade_group_id`) VALUES
(1, '六段・七段・八段・教士', '六七八段・教士', 4, 3),
(25, '範士・八段', '範士・八段', 4, 3),
(26, '教士・七段', '教士・七段', 5, 4),
(27, '錬士・七段', '錬士・七段', 6, 4),
(28, '八段・教士', '八段・教士', 5, 3),
(29, '六段・七段', '六段・七段', 0, 16),
(30, '六段・七段・錬士', '六・七段・錬士', 6, 16),
(31, '四段・五段・錬士五段', '四・五段・錬五', 6, 18),
(32, '初段～六段・錬士', '初～六段・錬士', 6, 31),
(33, '教士七段以上', '教七以上', 2, 13),
(34, '教士六段以上', '教六以上', 2, 12),
(35, '錬士六段以上', '錬六以上', 1, 12),
(36, '錬士五段以上', '錬五以上', 1, 11),
(37, '六段以上', '六段以上', 0, 12),
(38, '五段以上', '五段以上', 0, 11),
(39, '五段以下', '五段以下', 0, 29),
(40, '四段以上', '四段以上', 0, 26),
(41, '四段以下', '四段以下', 0, 30),
(42, '参段以上', '参段以上', 0, 27),
(43, '参段以下', '参段以下', 0, 28),
(44, '参段～五段', '参～五段', 0, 32),
(45, '初段～四段', '初～四段', 0, 20),
(46, '無指定～五段', '無～五段', 0, 29),
(47, '無指定～四段', '無～四段', 0, 30);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_holder_grade_order`
--

CREATE TABLE `m_holder_grade_order` (
  `holder_id` int(11) NOT NULL,
  `grade_id` int(11) NOT NULL,
  `holder_priority_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '称号優先順位フラグ',
  `hg_order` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_holder_grade_order`
--

INSERT INTO `m_holder_grade_order` (`holder_id`, `grade_id`, `holder_priority_flg`, `hg_order`) VALUES
(0, 6, 0, 9),
(0, 7, 0, 10),
(0, 8, 0, 11),
(0, 9, 0, 12),
(0, 10, 0, 13),
(0, 11, 0, 14),
(0, 12, 0, 15),
(0, 13, 0, 16),
(0, 14, 0, 17),
(0, 15, 0, 18),
(1, 1, 0, 1),
(1, 2, 0, 2),
(1, 3, 1, 3),
(2, 3, 0, 4),
(2, 4, 0, 5),
(2, 5, 1, 6),
(3, 5, 0, 7),
(3, 6, 1, 8);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_holder_group`
--

CREATE TABLE `m_holder_group` (
  `holder_group_id` int(11) NOT NULL,
  `holder_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_holder_group`
--

INSERT INTO `m_holder_group` (`holder_group_id`, `holder_id`) VALUES
(1, 1),
(1, 2),
(1, 3),
(2, 1),
(2, 2),
(3, 2),
(3, 3),
(4, 1),
(5, 2),
(6, 3);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_kaijo`
--

CREATE TABLE `m_kaijo` (
  `kaijo_id` int(11) NOT NULL,
  `kaijo_name` varchar(128) NOT NULL,
  `kaijo_name_short` varchar(64) NOT NULL,
  `kaijo_name_abb` varchar(8) NOT NULL,
  `pref_id` int(11) NOT NULL COMMENT '県コード',
  `organiz_local_flg` tinyint(4) NOT NULL DEFAULT 0 COMMENT '地方審査会場フラグ',
  `order_pref` smallint(6) NOT NULL COMMENT '表示順位（県）',
  `order_kasugai` smallint(6) NOT NULL COMMENT '表示順位（協会）',
  `use_flg` tinyint(4) NOT NULL DEFAULT 1 COMMENT '使用フラグ',
  `created` datetime NOT NULL,
  `modified` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_kaijo`
--

INSERT INTO `m_kaijo` (`kaijo_id`, `kaijo_name`, `kaijo_name_short`, `kaijo_name_abb`, `pref_id`, `organiz_local_flg`, `order_pref`, `order_kasugai`, `use_flg`, `created`, `modified`) VALUES
(1, '三笠市弓道場', '三笠市弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(2, '千歳市開基記念総合武道館弓道場', '千歳市弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(3, '帯広の森弓道場', '帯広弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(4, '苫小牧市総合体育館弓道場', '苫小牧弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(5, '北ガスアリーナ札幌４６弓道室', '北ガスアリーナ', '北海道', 1, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(6, '北海道立総合体育センター弓道場', '北海道弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(7, '北見市武道館弓道場', '北見市弓道場', '北海道', 1, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(8, '岩手県営武道館弓道場', '岩手県武弓道場', '岩手', 3, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(9, '宮城県弓道場', '宮城弓道場', '宮城', 4, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(10, '宮城県武道館弓道場', '宮城県武弓道場', '宮城', 4, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(11, '秋田県立武道館弓道場', '秋田県武弓道場', '秋田', 5, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(12, '山形市総合スポーツセンター弓道場', '山形市弓道場', '山形', 6, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(13, '米沢市営武道館弓道場', '米沢市弓道場', '山形', 6, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(14, '郡山総合運動公園 開成山弓道場', '郡山弓道場', '福島', 7, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(15, '茨城県武道館弓道場', '茨城県武弓道場', '茨城', 8, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(16, '取手市グリーンスポーツセンター弓道場', '取手市弓道場', '茨城', 8, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(17, '堀原運動公園武道館弓道場', '堀原弓道場', '茨城', 8, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(18, 'ユウケイ武道館弓道場', 'ユウケイ弓道場', '栃木', 9, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(19, 'ALSOKぐんま武道館弓道場', 'ALSOK弓道場', '群馬', 10, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(20, '埼玉県営大宮公園弓道場', '大宮弓道場', '埼玉', 11, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(21, '埼玉県立武道館弓道場', '埼玉県武弓道場', '埼玉', 11, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(22, '千葉県総合スポーツセンター弓道場', '千葉県弓道場', '千葉', 12, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(23, '全日本弓道連盟中央道場', '全弓連中央道場', '東京', 13, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(24, '東京武道館弓道場', '東京武道弓道場', '東京', 13, 0, 3, 0, 1, '2024-11-26 22:52:05', NULL),
(25, '日本武道館弓道場', '日本武道館', '東京', 13, 0, 4, 0, 1, '2024-11-26 22:52:05', NULL),
(26, '明治神宮至誠館・全弓連中央道場', '明治神宮弓道場', '東京', 13, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(27, '鎌倉武道館弓道場', '鎌倉弓道場', '鎌倉', 14, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(28, '神奈川県立武道館弓道場', '神奈川弓道場', '神奈川', 14, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(29, '新潟県立武道館（謙信公武道館弓道場）', '謙信弓道場', '新潟', 15, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(30, '新潟市鳥屋野総合体育館弓道場', '鳥屋野弓道場', '新潟', 15, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(31, '新津地域学園弓道場', '新津弓道場', '新潟', 15, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(32, '県営富山弓道場', '富山弓道場', '富山', 16, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(33, '射水市大島弓道場', '射水弓道場', '富山', 16, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(34, '石川県立武道館弓道場', '石川県武弓道場', '石川', 17, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(35, '福井県立武道館弓道場', '福井県武弓道場', '福井', 18, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(36, '山梨県小瀬スポーツ公園　武道館弓道場', '山梨県武弓道場', '山梨', 19, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(37, '長野運動公園総合運動場弓道場', '須坂市弓道場', '長野総', 20, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(38, '長野県飯田運動公園弓道場', '長野弓道場', '長野', 20, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(39, '岐阜メモリアルセンター弓道場', '長良川弓道場', '長良川', 21, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(40, '静岡県武道館', '静岡県武道館', '藤枝', 22, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(41, '浜松市弓道場', '浜松市弓道場', '浜松', 22, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(42, '愛知県武道館弓道場', '県武道館', '県武', 23, 1, 0, 3, 1, '2024-11-26 22:52:05', NULL),
(43, '一宮市大宮公園弓道場', '一宮市弓道場', '一宮', 23, 0, 0, 8, 1, '2024-11-26 22:52:05', NULL),
(44, '岡崎中央総合公園弓道場', '岡崎弓道場', '岡崎', 23, 1, 0, 4, 1, '2024-11-26 22:52:05', NULL),
(45, '蒲郡市民体育センター弓道場', '蒲郡弓道場', '蒲郡', 23, 1, 0, 6, 1, '2024-11-26 22:52:05', NULL),
(46, '春日井総合体育館', '春日井総合', '春日井', 23, 0, 0, 1, 1, '2024-11-26 22:52:05', NULL),
(47, '瀬戸市民公園弓道場', '瀬戸弓道場', '瀬戸', 23, 0, 0, 9, 1, '2024-11-26 22:52:05', NULL),
(48, '長久手古戦場弓道場', '長久手弓道場', '長久手', 23, 0, 0, 10, 1, '2024-11-26 22:52:05', NULL),
(49, '津島市錬成館弓道場', '錬成館', '津島', 23, 0, 0, 7, 1, '2024-11-26 22:52:05', NULL),
(50, '日本ガイシスポーツアリーナ弓道場', 'ガイシ弓道場', 'ガイシ', 23, 1, 0, 2, 1, '2024-11-26 22:52:05', NULL),
(51, '豊川市武道館弓道場', '豊川弓道場', '豊川', 23, 1, 0, 5, 1, '2024-11-26 22:52:05', NULL),
(52, '豊田市運動公園弓道場', '豊田運動公園', '豊田', 23, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(53, '三重武道館弓道遠的場', '三重県武弓道場', '津', 24, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(54, '四日市市総合体育館弓道場', '四日市弓道場', '四日市', 24, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(55, '神宮弓道場', '神宮弓道場', '伊勢', 24, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(56, '日硝ハイウエーアリーナ（サオリーナ）', 'サオリーナ', '三重', 24, 0, 3, 0, 1, '2024-11-26 22:52:05', NULL),
(57, 'プロシードアリーナHIKONE　彦根市弓道場', '彦根市弓道場', '彦根', 25, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(58, '滋賀県立武道館弓道場', '滋賀県武弓道場', '滋賀', 25, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(59, '京都市勧業館「みやこめっせ」', 'みやこめっせ', '京都', 26, 0, 1, 11, 1, '2024-11-26 22:52:05', NULL),
(60, '京都市武道センター', '京都武道', '京都', 26, 0, 2, 0, 1, '2024-11-26 22:52:05', NULL),
(61, '万博記念公園 弓道場', '万博弓道場', '大阪', 27, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(62, '鳥取県立武道館弓道場', '鳥取県武弓道場', '鳥取', 31, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(63, '島根県立武道館弓道場', '島根県武弓道場', '島根', 32, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(64, '岡山県倉敷運動公園弓道場', '倉敷弓道場', '岡山', 33, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(65, '総社市営弓道場', '総社市弓道場', '岡山', 33, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(66, '広島県立総合体育館弓道場', '広島県弓道場', '広島', 34, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(67, '維新百年記念公園弓道場', '山口県弓道場', '山口', 35, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(68, '徳島県立中央武道館弓道場', '徳島県武弓道場', '徳島', 36, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(69, '香川県立武道館弓道場', '香川県弓道場', '香川', 37, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(70, '愛媛県総合運動公園弓道場', '愛媛弓道場', '愛媛', 38, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(71, '高知県立弓道場', '高知県弓道場', '高知', 39, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(72, '東平尾公園博多の森弓道場', '博多の森弓道場', '博多', 40, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(73, '福岡市総合体育館弓道場', '福岡市弓道場', '福岡', 40, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(74, '福岡武道館弓道場', '福岡県武弓道場', '福岡', 40, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(75, 'ＳＡＧＡプラザ', 'SAGAプラザ', '佐賀', 41, 0, 1, 0, 1, '2024-11-26 22:52:05', NULL),
(76, '多久市緑が丘弓道場', '多久市弓道場', '佐賀', 41, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(77, '熊本市植木弓道場', '熊本弓道場', '熊本', 43, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(78, '宮崎県体育館弓道場', '宮崎県弓道場', '宮崎', 45, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(79, '都城市早水公園体育文化センター', '都城弓道場', '都城', 45, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL),
(80, '出水市総合武道館弓道場', '出水市弓道場', '鹿児島', 46, 0, 0, 0, 1, '2024-11-26 22:52:05', NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_member`
--

CREATE TABLE `m_member` (
  `member_id` int(11) NOT NULL,
  `name_f` varchar(20) NOT NULL,
  `name_s` varchar(20) NOT NULL,
  `kana_f` varchar(20) NOT NULL,
  `kana_s` varchar(20) NOT NULL,
  `gender_cd` tinyint(4) NOT NULL,
  `kasugai_regist_flg` tinyint(1) NOT NULL DEFAULT 1 COMMENT '春日井弓道協会登録フラグ',
  `kasugai_regist_date` date DEFAULT NULL COMMENT '春日井弓道協会登録日',
  `aiti_renmei_regist_flg` tinyint(1) NOT NULL COMMENT '愛弓連登録フラグ',
  `renmei_id` int(8) NOT NULL COMMENT '全弓連ID',
  `mail_address` varchar(128) DEFAULT NULL,
  `login_id` varchar(16) DEFAULT NULL,
  `login_pw` varchar(60) DEFAULT NULL,
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_member`
--

INSERT INTO `m_member` (`member_id`, `name_f`, `name_s`, `kana_f`, `kana_s`, `gender_cd`, `kasugai_regist_flg`, `kasugai_regist_date`, `aiti_renmei_regist_flg`, `renmei_id`, `mail_address`, `login_id`, `login_pw`, `created`, `modefied`) VALUES
(1, '渕元', '魏', 'ふちもと', 'たかし', 1, 1, '1981-03-15', 1, 0, '', '', '', '2024-11-19 14:25:54', '2024-11-19 14:25:54'),
(2, '藤島', '正己', 'ふじしま', 'まさみ', 1, 1, '1981-03-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(3, '西', '久夫', 'にし', 'ひさお', 1, 1, '1981-03-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(4, '小栗', '一浩', 'おぐり', 'かずひろ', 1, 1, NULL, 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(5, '小野田', '聡', 'おのだ', 'さとし', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(6, '鈴木', '孝明', 'すずき', 'たかあき', 1, 1, '2003-04-01', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(7, '秋田', '守人', 'あきた', 'もりひと', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(8, '目黒', '靖彦', 'めぐろ', 'やすひこ', 1, 1, '2017-07-08', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(9, '伊藤', '伸男', 'いとう', 'のぶお', 1, 1, '2002-05-11', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(10, '金子', '勝秋', 'かねこ', 'かつあき', 1, 1, '1981-03-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(11, '渡辺', '英男', 'わたなべ', 'ひでお', 1, 1, '1986-11-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(12, '舩戸', '千恵子', 'ふなと', 'ちえこ', 2, 1, NULL, 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(13, '山口', 'このみ', 'やまぐち', 'このみ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(14, '森本', '敬子', 'もりもと', 'けいこ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(15, '稲田', '直也', 'いなだ', 'なおや', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(16, '杉山', '武', 'すぎやま', 'たけし', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(17, '玉野', '正明', 'たまの', 'まさあき', 1, 1, '2008-02-29', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(18, '松原', '均', 'まつばら', 'ひとし', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(19, '川邊', '曉', 'かわべ', 'さとる', 1, 1, '2006-09-23', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(20, '七田', '和彦', 'しちだ', 'かずひこ', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(21, '中川', '節子', 'なかがわ', 'せつこ', 2, 1, NULL, 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(22, '糟谷', '理恵子', 'かすや', 'りえこ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(23, '樋口', '孝子', 'ひぐち', 'たかこ', 2, 1, '2010-04-01', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(24, '富所', '修', 'とみどころ', 'おさむ', 1, 1, '2007-04-01', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(25, '犬飼', '正子', 'いぬかい', 'まさこ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(26, '樋口', '成司', 'ひぐち', 'しげじ', 1, 1, '2011-01-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(27, '菅野', '靖子', 'かんの', 'やすこ', 2, 1, '2009-10-05', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(28, '遠藤', '恵美子', 'えんどう', 'えみこ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(29, '目黒', '千恵子', 'めぐろ', 'ちえこ', 2, 1, '2017-07-08', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(30, '西尾', '典子', 'にしお', 'のりこ', 2, 1, '2010-08-22', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(31, '村手', '哲雄', 'むらて', 'てつお', 1, 1, '1981-03-15', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(32, '今泉', '博至', 'いまいずみ', 'ひろし', 1, 1, '1981-03-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(33, '舩戸', '直博', 'ふなと', 'なおひろ', 1, 1, NULL, 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(34, '稲田', '真代', 'いなだ', 'まさよ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(35, '杉山', '寿美代', 'すぎやま', 'すみよ', 2, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(36, '松井', '勝安', 'まつい', 'かつやす', 1, 1, '2003-09-26', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(37, '天野', '浩晃', 'あまの', 'ひろあき', 1, 1, '2012-10-10', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(38, '伊藤', '洋子', 'いとう', 'ようこ', 2, 1, '2004-05-08', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(39, '遠山', 'すみれ', 'とおやま', 'すみれ', 2, 1, '2003-05-10', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(40, '小原', '伸二', 'おばら', 'しんじ', 1, 1, '2003-05-10', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(41, '片桐', '志保', 'かたぎり', 'しほ', 2, 1, '2009-05-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(42, '田井', '泰', 'たい', 'やすし', 1, 1, '2019-09-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(43, '原田', '真由美', 'はらだ', 'まゆみ', 2, 1, '2001-05-25', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(44, '石黒', '靖司', 'いしぐろ', 'せいじ', 1, 1, '2007-05-25', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(45, '井濵', '美夏子', 'いはま', 'みかこ', 2, 1, '2004-05-08', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(46, '渕元', '多美子', 'ふちもと', 'たみこ', 2, 1, '2005-03-30', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(47, '鈴木', '和貴', 'すずき', 'かずき', 1, 1, '2015-10-28', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(48, '正村', '知穗', 'まさむら', 'ちほ', 2, 1, '2006-09-28', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(49, '小島', '琴音', 'こじま', 'ことね', 2, 1, '2019-04-18', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(50, '高木', '友香', 'たかぎ', 'ゆか', 2, 1, '2019-04-18', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(51, '高見', '剛', 'たかみ', 'たけし', 1, 1, '2018-07-14', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(52, '田中', '真希', 'たなか', 'まき', 2, 1, '2010-05-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(53, '杉浦', '秀一朗', 'すぎうら', 'しゅういちろう', 1, 1, '2020-01-19', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(54, '伊藤', '恭浩', 'いとう', 'やすひろ', 1, 1, '2018-07-28', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(55, '阿部', '健二郎', 'あべ', 'けんじろう', 1, 1, '2017-05-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(56, '杉野', '元彦', 'すぎの', 'もとひこ', 1, 1, '2023-07-21', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(57, '渡會', 'あすか', 'わたらい', 'あすか', 2, 1, '2019-07-13', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(58, '鏡味', '寿規', 'かがみ', 'ひさき', 1, 1, NULL, 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(59, '遠藤', '陸郎', 'えんどう', 'りくろう', 1, 1, '2003-05-10', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(60, '菅原', '歌織', 'すがはら', 'かおり', 2, 1, '2006-04-02', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(61, '岩野', '和人', 'いわの', 'かずと', 1, 1, '2009-07-25', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(62, '佃', '弘美', 'つくだ', 'ひろみ', 2, 1, '2004-05-08', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(63, '遠藤', '寛子', 'えんどう', 'ひろこ', 2, 1, '2007-05-12', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(64, '尾崎', '尚志', 'おざき', 'たかし', 1, 1, '2018-12-03', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(65, '今井', '厚文', 'いまい', 'あつふみ', 1, 1, '2017-12-23', 1, 0, 'imai.0221@gmail.com', 'imai21', '$2y$12$K.rEu/IZ20pXWbTGEsIsnecBHhdyaM/1LPxxvMuLXiUvDqtoipqgC', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(66, '峯', '徹', 'みね', 'とおる', 1, 1, '2015-05-09', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(67, '井口', '孝之', 'いぐち', 'たかゆき', 1, 1, '2015-05-09', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(68, '上田', '恵', 'うえた', 'めぐみ', 2, 1, '2012-05-20', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(69, '長谷川', '真次', 'はせがわ', 'しんじ', 1, 1, '2014-03-26', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(70, '丸山', '祐里枝', 'まるやま', 'ゆりえ', 2, 1, '2024-08-04', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(71, '石井', '由美子', 'いしい', 'ゆみこ', 2, 1, '2009-05-16', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(72, '松林', '秀彦', 'まつばやし', 'ひでひこ', 1, 1, '2009-05-04', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(73, '深川', '舞音', 'ふかがわ', 'まいね', 2, 1, '2014-05-10', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(74, '千田', '幸恵', 'せんだ', 'さちえ', 2, 1, '2017-06-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(75, '舘野', '健三', 'たちの', 'けんぞう', 1, 1, '2009-05-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(76, '林田', '研治', 'はやしだ', 'けんじ', 1, 1, '2012-05-20', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(77, '大嶋', '啓嗣', 'おおしま', 'けいし', 1, 1, '2012-05-20', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(78, '天野', '麻実', 'あまの', 'まみ', 2, 1, '2019-04-18', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(79, '和田', '典之', 'わだ', 'のりゆき', 1, 1, '2021-04-11', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(80, '杉原', '由紀子', 'すぎはら', 'ゆきこ', 2, 1, '2022-05-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(81, '長尾', '美里', 'ながお', 'みさと', 2, 1, '2022-10-02', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(82, '長谷川', 'さなえ', 'はせがわ', 'さなえ', 2, 1, '2016-05-14', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(83, 'ヒル', '和代', 'ひる', 'かずよ', 2, 1, '2022-05-05', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(84, '松原', '萌香', 'まつばら', 'もか', 2, 1, '2024-06-01', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(85, '福滿', '千鶴', 'ふくみつ', 'ちづる', 2, 1, '2022-07-21', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(86, '中野', '利彦', 'なかの', 'としひこ', 1, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(87, '成瀬', '浩章', 'なるせ', 'ひろあき', 1, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(88, '伊藤', '久子', 'いとう', 'ひさこ', 2, 1, NULL, 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(89, '山口', '弘恵', 'やまぐち', 'ひろえ', 2, 1, '2005-05-30', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(90, '高木', '義政', 'たかぎ', 'よしまさ', 1, 1, '2008-09-26', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(91, '安藤', '由紀子', 'あんどう', 'ゆきこ', 2, 1, '2010-05-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(92, '木村', '孝亮', 'きむら', 'こうすけ', 1, 1, '2013-03-20', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(93, '齋藤', '直子', 'さいとう', 'なおこ', 2, 1, '2012-12-20', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(94, '稲田', '明子', 'いなだ', 'あきこ', 2, 1, '2021-04-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(95, '宮内', '彩', 'みやうち', 'あや', 2, 1, '2023-05-22', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(96, '峰数', '琉冴', 'みねかず', 'りゅうが', 1, 1, '2023-07-02', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(97, '成瀬', '律子', 'なるせ', 'りつこ', 2, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(98, '柴田', '彰子', 'しばた', 'あきこ', 2, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(99, '岡野', '美奈子', 'おかの', 'みなこ', 2, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(100, '山田', '里恵', 'やまだ', 'りえ', 2, 1, '2022-07-16', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(101, '馬渕', '満奈子', 'まぶち', 'みなこ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(102, '野口', '愛', 'のぐち', 'あい', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(103, '村上', '黎弥', 'むらかみ', 'れいや', 1, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(104, '勝川', '真裕子', 'かつかわ', 'まゆこ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(105, '山本', '朋果', 'やまもと', 'ともか', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(106, '加藤', '聖子', 'かとう', 'せいこ', 2, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(107, '湯淺', '圭音', 'ゆあさ', 'けいと', 2, 1, '2024-04-01', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(108, '須原', '明美', 'すはら', 'あけみ', 2, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(109, '小川', '紗矢', 'おがわ', 'さや', 2, 1, '2024-10-25', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(110, '樋田', '万紀', 'といだ', 'まき', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(111, '藤掛', '昌子', 'ふじかけ', 'まさこ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(112, '塚本', '裕昭', 'つかもと', 'ひろあき', 1, 1, '2004-04-05', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(113, '野田', 'すず佳', 'のだ', 'すずか', 2, 1, '2013-06-24', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(114, '伊納', '尚男', 'いのう', 'ひさお', 1, 1, '2015-05-09', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(115, '加藤', '豪', 'かとう', 'ごう', 1, 1, '2018-07-14', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(116, '入谷', '健', 'いりたに', 'けん', 1, 1, '2019-07-13', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(117, '中島', '都', 'なかじま', 'みやこ', 2, 1, '2022-07-16', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(118, '寺尾', '政弘', 'てらお', 'まさひろ', 1, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(119, '澤谷', '晴美', 'さわたに', 'はるみ', 2, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(120, '鈴木', '祐佳', 'すずき', 'ゆか', 2, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(121, '杉野', '亜希子', 'すぎの', 'あきこ', 2, 1, '2023-07-15', 1, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(122, '高橋', '伸治', 'たかはし', 'しんじ', 1, 1, '2023-07-15', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(123, '寺澤', '瑠夏', 'てらさわ', 'るな', 2, 1, '2023-07-15', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(124, '岩越', '亜矢己', 'いわこし', 'あやみ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(125, '丸井', 'ゆかり', 'まるい', 'ゆかり', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(126, '中里', '佳子', 'なかざと', 'けいこ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(127, '清水', '美和子', 'しみず', 'みわこ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(128, '下川', '梢', 'しもかわ', 'こずえ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(129, '西澤', '瞳', 'にしざわ', 'ひとみ', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(130, '緒方', 'はる奈', 'おがた', 'はるな', 2, 1, '2024-07-13', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00'),
(131, '生田', '泰嗣', 'いくた', 'たいし', 1, 1, '2024-07-23', 0, 0, '', '', '', '2024-11-20 00:00:00', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_menu`
--

CREATE TABLE `m_menu` (
  `menu_id` int(11) NOT NULL,
  `menu_name` varchar(64) NOT NULL COMMENT 'カテゴリー名',
  `controller` varchar(128) NOT NULL,
  `order_no` smallint(6) NOT NULL COMMENT '表示順',
  `use_flg` tinyint(4) NOT NULL COMMENT '使用フラグ',
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_menu`
--

INSERT INTO `m_menu` (`menu_id`, `menu_name`, `controller`, `order_no`, `use_flg`, `created`, `modefied`) VALUES
(1, '審査', 'shinsa', 1, 1, '2024-12-03 14:04:59', '0000-00-00 00:00:00'),
(2, '大会', 'taikai', 1, 1, '2024-12-03 14:04:59', '0000-00-00 00:00:00'),
(3, '講習会', 'workshop', 1, 1, '2024-12-03 14:04:59', '0000-00-00 00:00:00'),
(4, 'カレンダー', 'calender', 1, 1, '2024-12-03 14:04:59', '0000-00-00 00:00:00'),
(5, '会員名簿', 'member', 1, 1, '2024-12-03 14:04:59', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_menu_category`
--

CREATE TABLE `m_menu_category` (
  `menu_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `method` varchar(128) DEFAULT NULL COMMENT 'メソッド名',
  `tab_id` tinyint(2) DEFAULT NULL COMMENT 'タブID',
  `url` varchar(1000) DEFAULT NULL COMMENT '外部URL',
  `order_no` smallint(6) NOT NULL,
  `use_flg` tinyint(4) NOT NULL DEFAULT 1,
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_menu_category`
--

INSERT INTO `m_menu_category` (`menu_id`, `category_id`, `method`, `tab_id`, `url`, `order_no`, `use_flg`, `created`, `modefied`) VALUES
(1, 5, 'index', 4, NULL, 1, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(1, 6, 'index', 5, NULL, 2, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(1, 7, 'index', 6, NULL, 3, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(2, 1, 'index', 1, NULL, 1, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(2, 8, NULL, 8, NULL, 5, 1, '2024-12-12 14:29:40', '2024-12-12 14:29:40'),
(3, 1, 'index', 1, NULL, 1, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(3, 2, 'index', 2, NULL, 2, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(3, 3, 'index', 3, NULL, 4, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00'),
(3, 4, 'index', 7, NULL, 3, 1, '2024-12-03 22:27:53', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_menu_tab`
--

CREATE TABLE `m_menu_tab` (
  `tab_id` int(11) NOT NULL,
  `tab_name` varchar(16) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_menu_tab`
--

INSERT INTO `m_menu_tab` (`tab_id`, `tab_name`) VALUES
(3, 'aikyuren'),
(6, 'chiho'),
(4, 'chuou'),
(1, 'kasugai'),
(8, 'other'),
(5, 'rengo'),
(7, 'tokairengo'),
(2, 'zenkyuren');

-- --------------------------------------------------------

--
-- テーブルの構造 `m_pref`
--

CREATE TABLE `m_pref` (
  `pref_id` int(11) NOT NULL,
  `pref_name` varchar(16) NOT NULL,
  `order_no` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='都道府県マスタ';

--
-- テーブルのデータのダンプ `m_pref`
--

INSERT INTO `m_pref` (`pref_id`, `pref_name`, `order_no`) VALUES
(1, '北海道', 0),
(2, '青森県', 0),
(3, '岩手県', 0),
(4, '宮城県', 0),
(5, '秋田県', 0),
(6, '山形県', 0),
(7, '福島県', 0),
(8, '茨城県', 0),
(9, '栃木県', 0),
(10, '群馬県', 0),
(11, '埼玉県', 0),
(12, '千葉県', 0),
(13, '東京都', 0),
(14, '神奈川県', 0),
(15, '新潟県', 0),
(16, '富山県', 0),
(17, '石川県', 0),
(18, '福井県', 0),
(19, '山梨県', 0),
(20, '長野県', 0),
(21, '岐阜県', 2),
(22, '静岡県', 4),
(23, '愛知県', 1),
(24, '三重県', 3),
(25, '滋賀県', 0),
(26, '京都府', 0),
(27, '大阪府', 0),
(28, '兵庫県', 0),
(29, '奈良県', 0),
(30, '和歌山県', 0),
(31, '鳥取県', 0),
(32, '島根県', 0),
(33, '岡山県', 0),
(34, '広島県', 0),
(35, '山口県', 0),
(36, '徳島県', 0),
(37, '香川県', 0),
(38, '愛媛県', 0),
(39, '高知県', 0),
(40, '福岡県', 0),
(41, '佐賀県', 0),
(42, '長崎県', 0),
(43, '熊本県', 0),
(44, '大分県', 0),
(45, '宮崎県', 0),
(46, '鹿児島県', 0),
(47, '沖縄県', 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_setting`
--

CREATE TABLE `m_setting` (
  `fiscal_year_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_setting`
--

INSERT INTO `m_setting` (`fiscal_year_id`) VALUES
(24);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_shinsa_class`
--

CREATE TABLE `m_shinsa_class` (
  `shinsa_class_id` int(11) NOT NULL,
  `shinsa_class_name` varchar(16) NOT NULL,
  `shinsa_class_name_short` varchar(8) NOT NULL,
  `order_no` tinyint(4) NOT NULL,
  `menu_flg` tinyint(4) NOT NULL COMMENT 'メニュー表示フラグ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_shinsa_class`
--

INSERT INTO `m_shinsa_class` (`shinsa_class_id`, `shinsa_class_name`, `shinsa_class_name_short`, `order_no`, `menu_flg`) VALUES
(1, '中央審査', '中央', 1, 1),
(2, '連合審査', '連合', 2, 1),
(3, '地方審査', '地方', 3, 1),
(4, 'ビデオ審査', 'ビデオ', 4, 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_shinsa_name`
--

CREATE TABLE `m_shinsa_name` (
  `shinsa_name_id` int(11) NOT NULL,
  `shinsa_name` varchar(128) NOT NULL,
  `shinsa_name_short` varchar(16) NOT NULL,
  `chuou_flg` tinyint(4) NOT NULL DEFAULT 0 COMMENT '中央審査フラグ',
  `rengou_flg` tinyint(4) NOT NULL DEFAULT 0 COMMENT '連合審査フラグ',
  `chihou_flg` tinyint(4) NOT NULL DEFAULT 0 COMMENT '地方審査フラグ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_shinsa_name`
--

INSERT INTO `m_shinsa_name` (`shinsa_name_id`, `shinsa_name`, `shinsa_name_short`, `chuou_flg`, `rengou_flg`, `chihou_flg`) VALUES
(1, '定期中央審査会', '定期中央', 1, 0, 0),
(2, '臨時中央審査会', '臨時中央', 1, 0, 0),
(3, '錬士臨時中央審査会', '錬士中央', 1, 0, 0),
(4, '特別臨時中央審査会', '特別中央', 1, 0, 0),
(5, '特別教員臨時中央審査会', '教員中央', 1, 0, 0),
(6, '特別学生臨時中央審査会', '学生中央', 1, 0, 0),
(7, '連合審査会', '連合', 0, 1, 0),
(8, '地方審査会', '地方', 0, 0, 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `m_taikai`
--

CREATE TABLE `m_taikai` (
  `taikai_m_id` int(11) NOT NULL,
  `taikai_name` varchar(64) NOT NULL,
  `taikai_name_short` varchar(16) NOT NULL,
  `near_far_flg` int(11) NOT NULL DEFAULT 0 COMMENT '近的遠的フラグ 0:近的、1：遠的',
  `kasugai_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '春日井弓道協会大会フラグ',
  `gender_id` tinyint(1) NOT NULL DEFAULT 0 COMMENT '性別ID',
  `age_limit_min` int(3) NOT NULL DEFAULT 0 COMMENT '参加可能最低年齢',
  `age_limit_max` int(3) NOT NULL DEFAULT 130 COMMENT '参加可能最高年齢'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `m_taikai`
--

INSERT INTO `m_taikai` (`taikai_m_id`, `taikai_name`, `taikai_name_short`, `near_far_flg`, `kasugai_flg`, `gender_id`, `age_limit_min`, `age_limit_max`) VALUES
(1, '春日井市弓道選手権大会', '選手権', 0, 1, 0, 0, 130),
(2, '春日井市長杯弓道大会', '市長杯', 0, 1, 0, 0, 130),
(3, '春日井市民大会', '市民大会', 0, 1, 0, 0, 130),
(4, '春日井市高校団体選手権', '高校選手権', 0, 1, 0, 0, 130),
(5, '新年射会', '新年射会', 0, 1, 0, 0, 130),
(6, '全日本弓道大会', '京都大会', 0, 0, 0, 0, 130),
(7, '全日本女子近的弓道選手権', '全日本女子', 0, 0, 2, 0, 130),
(8, '全日本男子近的弓道選手権', '全日本男子', 0, 0, 1, 0, 130),
(9, '中日本近的選手権', '中日本近的', 0, 0, 0, 0, 130),
(10, '中日本女子弓道大会', '中日本女子', 0, 0, 2, 0, 130),
(11, '東海連合弓道大会', '東海連合', 0, 0, 0, 0, 130),
(12, '東海弓道近的選手権大会', '東海近的', 0, 0, 0, 0, 130),
(13, '東海弓道遠的選手権大会', '東海遠的', 1, 0, 0, 0, 130),
(14, '国体東海ブロック大会', '国体東海', 0, 0, 0, 0, 130),
(15, '全弓道会対抗弓道大会', '弓道会対抗', 0, 0, 0, 0, 130),
(16, '県下近的選手権大会', '県下近的', 0, 0, 0, 0, 130),
(17, '県下遠的選手権大会', '県下遠的', 1, 0, 0, 0, 130),
(18, '尾張エリア大会', 'エリア大会', 0, 0, 0, 0, 130),
(19, '東尾張エリア大会', '東エリア大会', 0, 0, 0, 0, 130),
(20, 'ねんりん弓道大会', 'ねんりん', 0, 0, 0, 60, 130),
(21, '熱田神宮奉納弓道大会', '熱田神宮', 0, 0, 0, 0, 130),
(22, '津島神社奉納弓道大会', '津島神社奉納', 0, 0, 0, 0, 130),
(23, '護国神社奉納弓道大会', '護国神社奉納', 0, 0, 0, 0, 130),
(24, '護国神社弓始奉射会', '護国神社弓始', 0, 0, 0, 0, 130),
(25, '真清田神社桃花祭', '桃花祭', 0, 0, 0, 0, 130),
(26, '長久手古戦場祭', '古戦場祭', 0, 0, 0, 0, 130),
(27, '弾正祭', '弾正祭', 0, 0, 0, 0, 130),
(28, '星野祭弓道遠的大会', '星野祭遠的', 0, 0, 0, 0, 130),
(29, 'わかしゃち国体記念遠的弓道大会', 'わかしゃち', 1, 0, 0, 0, 130);

-- --------------------------------------------------------

--
-- テーブルの構造 `t_member_grade_holder`
--

CREATE TABLE `t_member_grade_holder` (
  `member_id` int(11) NOT NULL,
  `holder_id` int(11) NOT NULL,
  `holder_acquired_day` date DEFAULT NULL COMMENT '称号取得日',
  `grade_id` int(11) NOT NULL,
  `grade_acquired_day` date DEFAULT NULL COMMENT '段位取得日'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `t_member_grade_holder`
--

INSERT INTO `t_member_grade_holder` (`member_id`, `holder_id`, `holder_acquired_day`, `grade_id`, `grade_acquired_day`) VALUES
(1, 1, '2010-05-01', 3, '2006-05-06'),
(2, 2, '1984-05-06', 4, '1989-05-05'),
(3, 2, '2007-12-23', 4, '2010-12-05'),
(4, 2, NULL, 4, '2015-10-04'),
(5, 2, '2006-05-06', 5, '2000-06-04'),
(6, 2, '2009-08-10', 5, '0000-00-00'),
(7, 2, '2016-02-06', 5, '2012-09-09'),
(8, 2, NULL, 5, '2018-02-10'),
(9, 2, '2023-02-02', 5, '2019-02-11'),
(10, 3, '1985-12-08', 5, '1991-05-04'),
(11, 3, '2004-05-29', 5, '2010-05-23'),
(12, 3, '2010-05-22', 5, '2013-05-04'),
(13, 3, '2011-05-06', 5, '2013-05-26'),
(14, 3, '2002-12-08', 5, '2015-05-17'),
(15, 3, '2005-12-18', 5, '2016-05-22'),
(16, 3, '2009-12-20', 5, '2016-05-22'),
(17, 3, '2000-05-07', 5, '2016-09-11'),
(18, 3, '2010-12-18', 5, '2016-11-04'),
(19, 3, '2014-05-17', 5, '2019-02-11'),
(20, 3, '1997-05-06', 6, '1989-03-26'),
(21, 3, NULL, 6, '2006-12-24'),
(22, 3, '2009-05-06', 6, '2000-11-12'),
(23, 3, '2006-05-27', 6, '1996-03-31'),
(24, 3, '2010-09-11', 6, '2002-03-17'),
(25, 3, '2010-12-18', 6, '2006-06-04'),
(26, 3, '2005-07-03', 6, '1993-06-13'),
(27, 3, '2012-10-13', 6, '2002-09-22'),
(28, 3, '2015-05-16', 6, '2010-11-07'),
(29, 3, '2014-06-15', 6, '0000-00-00'),
(30, 3, '2023-12-23', 6, '2014-03-08'),
(31, 0, '0000-00-00', 6, '1981-09-27'),
(32, 0, '0000-00-00', 6, '1991-03-24'),
(33, 0, '0000-00-00', 6, '1996-11-17'),
(34, 0, '0000-00-00', 6, '1998-07-05'),
(35, 0, '0000-00-00', 6, '1999-09-15'),
(36, 0, '0000-00-00', 6, '2009-06-07'),
(37, 0, '0000-00-00', 6, '2013-03-24'),
(38, 0, '0000-00-00', 6, '2013-06-09'),
(39, 0, '0000-00-00', 6, '2014-03-08'),
(40, 0, '0000-00-00', 6, '2017-02-19'),
(41, 0, '0000-00-00', 6, '2017-06-11'),
(42, 0, '0000-00-00', 6, '2023-10-22'),
(43, 0, '0000-00-00', 7, '1998-09-27'),
(44, 0, '0000-00-00', 7, '2010-02-14'),
(45, 0, '0000-00-00', 7, '2011-03-12'),
(46, 0, '0000-00-00', 7, '2013-10-13'),
(47, 0, '0000-00-00', 7, '2014-07-20'),
(48, 0, '0000-00-00', 7, '2019-03-02'),
(49, 0, '0000-00-00', 7, '2008-04-27'),
(50, 0, '0000-00-00', 7, '2008-08-31'),
(51, 0, '0000-00-00', 7, '2019-06-23'),
(52, 0, '0000-00-00', 7, '2022-01-22'),
(53, 0, '0000-00-00', 7, '2022-10-09'),
(54, 0, '0000-00-00', 7, '2022-12-11'),
(55, 0, '0000-00-00', 7, '2024-05-19'),
(56, 0, '0000-00-00', 7, '2024-07-21'),
(57, 0, '0000-00-00', 7, '2024-08-11'),
(58, 0, '0000-00-00', 8, '2000-04-23'),
(59, 0, '0000-00-00', 8, '2005-11-13'),
(60, 0, '0000-00-00', 8, '2004-04-18'),
(61, 0, '0000-00-00', 8, '1992-06-21'),
(62, 0, '0000-00-00', 8, '2011-08-28'),
(63, 0, '0000-00-00', 8, '2016-04-10'),
(64, 0, '0000-00-00', 8, '2014-11-09'),
(65, 0, '0000-00-00', 8, '2021-01-23'),
(66, 0, '0000-00-00', 8, '2022-06-19'),
(67, 0, '0000-00-00', 8, '2023-06-18'),
(68, 0, '0000-00-00', 8, '2023-10-08'),
(69, 0, '0000-00-00', 8, '2024-07-21'),
(70, 0, '0000-00-00', 8, '2009-05-24'),
(71, 0, '0000-00-00', 9, '2011-03-12'),
(72, 0, '0000-00-00', 9, '2011-03-27'),
(73, 0, '0000-00-00', 9, '2016-10-09'),
(74, 0, '0000-00-00', 9, '2017-05-21'),
(75, 0, '0000-00-00', 9, '2018-02-18'),
(76, 0, '0000-00-00', 9, '2018-11-18'),
(77, 0, '0000-00-00', 9, '2019-02-17'),
(78, 0, '0000-00-00', 9, '2001-06-17'),
(79, 0, '0000-00-00', 9, '2000-04-23'),
(80, 0, '0000-00-00', 9, '1987-08-02'),
(81, 0, '0000-00-00', 9, '2015-03-15'),
(82, 0, '0000-00-00', 9, '2023-03-24'),
(83, 0, '0000-00-00', 9, '2024-04-14'),
(84, 0, '0000-00-00', 9, '2022-03-13'),
(85, 0, '0000-00-00', 9, '2024-07-21'),
(86, 0, '0000-00-00', 9, '2024-07-21'),
(87, 0, '0000-00-00', 9, '2024-09-15'),
(88, 0, '0000-00-00', 10, '2000-04-23'),
(89, 0, '0000-00-00', 10, '2007-06-03'),
(90, 0, '0000-00-00', 10, '2010-02-14'),
(91, 0, '0000-00-00', 10, '1990-11-11'),
(92, 0, '0000-00-00', 10, '2011-03-25'),
(93, 0, '0000-00-00', 10, '2015-04-12'),
(94, 0, '0000-00-00', 10, '2019-03-17'),
(95, 0, '0000-00-00', 10, '2017-07-31'),
(96, 0, '0000-00-00', 10, '2020-12-26'),
(97, 0, '0000-00-00', 10, '2023-11-30'),
(98, 0, '0000-00-00', 10, '2023-11-30'),
(99, 0, '0000-00-00', 10, '2023-11-30'),
(100, 0, '0000-00-00', 10, '2023-11-30'),
(101, 0, '0000-00-00', 10, '1992-12-06'),
(102, 0, '0000-00-00', 10, '2003-08-03'),
(103, 0, '0000-00-00', 10, '2012-12-31'),
(104, 0, '0000-00-00', 10, '2013-03-22'),
(105, 0, '0000-00-00', 10, '2015-03-31'),
(106, 0, '0000-00-00', 10, '2024-07-20'),
(107, 0, '0000-00-00', 10, '2024-07-20'),
(108, 0, '0000-00-00', 10, '2024-09-15'),
(109, 0, '0000-00-00', 10, '2016-12-11'),
(110, 0, '0000-00-00', 11, '1988-12-31'),
(111, 0, '0000-00-00', 11, '1989-02-28'),
(112, 0, '0000-00-00', 0, '0000-00-00'),
(113, 0, '0000-00-00', 0, '0000-00-00'),
(114, 0, '0000-00-00', 0, '0000-00-00'),
(115, 0, '0000-00-00', 0, '0000-00-00'),
(116, 0, '0000-00-00', 0, '0000-00-00'),
(117, 0, '0000-00-00', 0, '0000-00-00'),
(118, 0, '0000-00-00', 0, '0000-00-00'),
(119, 0, '0000-00-00', 0, '0000-00-00'),
(120, 0, '0000-00-00', 0, '0000-00-00'),
(121, 0, '0000-00-00', 0, '0000-00-00'),
(122, 0, '0000-00-00', 0, '0000-00-00'),
(123, 0, '0000-00-00', 0, '0000-00-00'),
(124, 0, '0000-00-00', 0, '0000-00-00'),
(125, 0, '0000-00-00', 0, '0000-00-00'),
(126, 0, '0000-00-00', 0, '0000-00-00'),
(127, 0, '0000-00-00', 0, '0000-00-00'),
(128, 0, '0000-00-00', 0, '0000-00-00'),
(129, 0, '0000-00-00', 0, '0000-00-00'),
(130, 0, '0000-00-00', 0, '0000-00-00'),
(131, 0, '0000-00-00', 0, '0000-00-00');

-- --------------------------------------------------------

--
-- テーブルの構造 `t_member_regist_fiscal`
--

CREATE TABLE `t_member_regist_fiscal` (
  `fiscal_year_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `aiti_renmei_regist_flg` tinyint(1) NOT NULL COMMENT '愛弓連登録フラグ	',
  `withdrawal_day` date DEFAULT NULL COMMENT '退会日',
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `t_member_regist_fiscal`
--

INSERT INTO `t_member_regist_fiscal` (`fiscal_year_id`, `member_id`, `aiti_renmei_regist_flg`, `withdrawal_day`, `created`, `modefied`) VALUES
(24, 1, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 2, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 3, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 4, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 5, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 6, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 7, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 8, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 9, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 10, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 11, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 12, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 13, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 14, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 15, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 16, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 17, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 18, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 19, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 20, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 21, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 22, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 23, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 24, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 25, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 26, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 27, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 28, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 29, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 30, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 31, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 32, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 33, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 34, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 35, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 36, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 37, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 38, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 39, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 40, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 41, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 42, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 43, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 44, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 45, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 46, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 47, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 48, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 49, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 50, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 51, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 52, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 53, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 54, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 55, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 56, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 57, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 58, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 59, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 60, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 61, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 62, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 63, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 64, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 65, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 66, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 67, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 68, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 69, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 70, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 71, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 72, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 73, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 74, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 75, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 76, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 77, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 78, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 79, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 80, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 81, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 82, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 83, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 84, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 85, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 86, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 87, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 88, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 89, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 90, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 91, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 92, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 93, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 94, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 95, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 96, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 97, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 98, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 99, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 100, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 101, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 102, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 103, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 104, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 105, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 106, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 107, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 108, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 109, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 110, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 111, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 112, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 113, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 114, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 115, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 116, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 117, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 118, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 119, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 120, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 121, 1, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 122, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 123, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 124, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 125, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 126, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 127, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 128, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 129, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 130, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00'),
(24, 131, 0, NULL, '2024-12-05 00:00:00', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `t_monthry_shooting`
--

CREATE TABLE `t_monthry_shooting` (
  `shooting_no` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='月例会情報';

-- --------------------------------------------------------

--
-- テーブルの構造 `t_notice_shinsa`
--

CREATE TABLE `t_notice_shinsa` (
  `notice_id` bigint(20) NOT NULL,
  `notice_title` varchar(256) NOT NULL COMMENT 'タイトル',
  `notice_body` text NOT NULL COMMENT '本文',
  `shinsa_id` int(11) NOT NULL COMMENT '審査ID',
  `att_file_url_1` varchar(1024) NOT NULL COMMENT '添付ファイルパス1',
  `att_filepath_2` varchar(1024) NOT NULL COMMENT '添付ファイルパス2',
  `att_filepath_3` varchar(1024) NOT NULL COMMENT '添付ファイルパス3',
  `att_filepath_4` varchar(1024) NOT NULL COMMENT '添付ファイルパス4',
  `att_filepath_5` varchar(1024) NOT NULL COMMENT '添付ファイルパス5',
  `att_filepath_6` varchar(1024) NOT NULL COMMENT '添付ファイルパス6',
  `att_filepath_7` varchar(1024) NOT NULL COMMENT '添付ファイルパス7',
  `att_filepath_8` varchar(1024) NOT NULL COMMENT '添付ファイルパス8',
  `att_filepath_9` varchar(1024) NOT NULL COMMENT '添付ファイルパス9',
  `att_filepath_10` varchar(1024) NOT NULL COMMENT '添付ファイルパス10',
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- テーブルの構造 `t_post_info`
--

CREATE TABLE `t_post_info` (
  `fiscal_year_id` int(11) NOT NULL,
  `post_name` varchar(20) NOT NULL,
  `m_id` int(11) NOT NULL,
  `order_no` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- テーブルの構造 `t_shinsa_info`
--

CREATE TABLE `t_shinsa_info` (
  `shinsa_id` int(11) NOT NULL COMMENT '審査ID',
  `shinsa_name` varchar(64) NOT NULL COMMENT '審査名',
  `shinsa_class_id` int(11) NOT NULL COMMENT '審査種別',
  `shinsa_name_id` int(11) NOT NULL COMMENT '審査会名ID',
  `area_group_id` int(11) NOT NULL COMMENT '地域名ID',
  `kaijo_id` int(11) NOT NULL COMMENT '会場ID',
  `kaijo_other_name` varchar(128) NOT NULL COMMENT 'その他会場名',
  `kaijo_other_name_abb` varchar(16) NOT NULL COMMENT 'その他会場略名',
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='月例会情報';

-- --------------------------------------------------------

--
-- テーブルの構造 `t_shinsa_member`
--

CREATE TABLE `t_shinsa_member` (
  `shinsa_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- テーブルの構造 `t_shinsa_target`
--

CREATE TABLE `t_shinsa_target` (
  `shinsa_id` int(11) NOT NULL COMMENT '審査ID',
  `holder_grade_id` int(11) NOT NULL COMMENT '称号段位グループID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- テーブルの構造 `t_taikai_info`
--

CREATE TABLE `t_taikai_info` (
  `taikai_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL COMMENT 'カテゴリーID',
  `fiscal_year_id` int(11) NOT NULL,
  `taikai_m_id` int(11) NOT NULL COMMENT '大会マスターID',
  `taikai_no` int(11) NOT NULL COMMENT '大会回数',
  `taikai_sub_name` varchar(64) NOT NULL COMMENT '大会サブ名称',
  `taikai_date_st` date DEFAULT NULL COMMENT '大会開始日',
  `taikai_date_ed` date DEFAULT NULL COMMENT '大会終了日',
  `taikai_open_time` time DEFAULT NULL COMMENT '開場時間',
  `taikai_uketuke_time` time DEFAULT NULL COMMENT '受付時間',
  `taikai_time_st` time DEFAULT NULL COMMENT '開始時間',
  `taikai_time_ed` time DEFAULT NULL COMMENT '終了時間',
  `uketuke_st` date DEFAULT NULL COMMENT '受付開始日',
  `uketuke_ed` date DEFAULT NULL COMMENT '受付終了日',
  `indi_apply_flg` tinyint(1) NOT NULL DEFAULT 0 COMMENT '個人申込フラグ',
  `kaijo_id` int(11) DEFAULT NULL COMMENT '会場ID',
  `kaijo_other` varchar(128) NOT NULL COMMENT '特設会場等',
  `eligibility` text NOT NULL COMMENT '参加資格',
  `competition_rules` text NOT NULL COMMENT '競技ルール',
  `awards` text NOT NULL COMMENT '表彰',
  `entry_fee` text NOT NULL COMMENT '参加費',
  `contact_info` text NOT NULL COMMENT '連絡事項',
  `created` datetime DEFAULT current_timestamp(),
  `modefied` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `t_taikai_info`
--

INSERT INTO `t_taikai_info` (`taikai_id`, `category_id`, `fiscal_year_id`, `taikai_m_id`, `taikai_no`, `taikai_sub_name`, `taikai_date_st`, `taikai_date_ed`, `taikai_open_time`, `taikai_uketuke_time`, `taikai_time_st`, `taikai_time_ed`, `uketuke_st`, `uketuke_ed`, `indi_apply_flg`, `kaijo_id`, `kaijo_other`, `eligibility`, `competition_rules`, `awards`, `entry_fee`, `contact_info`, `created`, `modefied`) VALUES
(1, 1, 24, 1, 43, '', '2024-04-21', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 46, '', '0', '', '', '', '', '2024-11-24 11:06:37', NULL),
(2, 1, 24, 2, 35, '', '2024-06-16', NULL, NULL, NULL, '00:00:00', '00:00:00', NULL, NULL, 0, 46, '', '0', '', '', '', '', '2024-06-01 00:00:00', NULL),
(3, 1, 24, 3, 47, '', '2024-10-20', NULL, NULL, NULL, '00:00:00', '00:00:00', NULL, NULL, 0, 46, '', '0', '', '', '', '', '2024-10-01 00:00:00', NULL),
(4, 1, 24, 4, 38, '', '2024-12-22', NULL, NULL, NULL, '00:00:00', '00:00:00', NULL, NULL, 0, 46, '', '0', '', '', '', '', '2024-12-01 00:00:00', NULL),
(5, 1, 24, 5, 0, '', '2025-01-19', NULL, NULL, NULL, '08:30:00', '17:00:00', NULL, NULL, 0, 46, '', '0', '', '', '', '', '2024-12-01 00:00:00', NULL),
(6, 8, 24, 24, 14, '', '2025-01-04', NULL, NULL, NULL, '09:00:00', '13:00:00', '2024-12-01', '2024-12-10', 0, NULL, '護國神社', '(一社)愛知県弓道連盟会員及その他愛好家', '近的競技（一手立射）', '個人奉射（皆中者は射詰競技により1位～３位を表彰）', '2,000円（初詣記念参加賞として神符・絵馬・社報を差し上げます）', '（１）大会役員並びに参加者全員は随時自由参拝をお願いします\r\n（２）境内に参加者の駐車場はなく、公共交通機関を利用してください\r\n地下鉄名城線「名古屋城」徒歩7分・\r\n地下鉄鶴舞線・桜通線「丸の内」徒歩10分\r\n（近隣に名古屋城駐車場あり）\r\n（３）貴重品は参加者各自で責任を持って\r\n管理してください\r\n（４）荒天中止\r\n（５）役員も奉射に参加できます。\r\n（６）お問い合わせは下記事務局まで\r\n愛知縣護國神社『弓始奉射会』運営委員会\r\n委 員長 小出 和歌子\r\n神社担当 石川 広大\r\n〒460-0001 名古屋市中区三の丸１－７－３\r\nTEL:052-201-8078\r\nFAX:052-221-879', '2024-12-20 21:06:14', NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `t_taikai_kasugai`
--

CREATE TABLE `t_taikai_kasugai` (
  `taikai_kasugai_id` int(11) NOT NULL,
  `taikai_id` int(11) NOT NULL COMMENT '大会マスターID',
  `taikai_no` int(11) NOT NULL COMMENT '大会回数',
  `taikai_sub_name` varchar(64) NOT NULL COMMENT '大会サブ名称',
  `taikai_date` date DEFAULT NULL COMMENT '大会日',
  `taikai_time_st` time DEFAULT NULL COMMENT '開始時間',
  `taikai_time_ed` time DEFAULT NULL COMMENT '終了時間',
  `kaijo_id` int(11) NOT NULL DEFAULT 46 COMMENT '会場ID',
  `eligibility` text NOT NULL COMMENT '参加資格',
  `competition_rules` text NOT NULL COMMENT '競技ルール',
  `awards` text NOT NULL COMMENT '表彰',
  `entry_fee` text NOT NULL COMMENT '参加費',
  `contact_info` text NOT NULL COMMENT '連絡事項',
  `created` datetime DEFAULT current_timestamp(),
  `modefied` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `t_taikai_kasugai`
--

INSERT INTO `t_taikai_kasugai` (`taikai_kasugai_id`, `taikai_id`, `taikai_no`, `taikai_sub_name`, `taikai_date`, `taikai_time_st`, `taikai_time_ed`, `kaijo_id`, `eligibility`, `competition_rules`, `awards`, `entry_fee`, `contact_info`, `created`, `modefied`) VALUES
(1, 1, 43, '', '2024-04-21', '00:00:00', '00:00:00', 46, '0', '', '', '', '', '2024-11-24 11:06:37', NULL),
(2, 2, 35, '', '2024-06-16', '00:00:00', '00:00:00', 46, '0', '', '', '', '', '2024-06-01 00:00:00', NULL),
(3, 3, 47, '', '2024-10-20', '00:00:00', '00:00:00', 46, '0', '', '', '', '', '2024-10-01 00:00:00', NULL),
(4, 4, 38, '', '2024-12-22', '00:00:00', '00:00:00', 46, '0', '', '', '', '', '2024-12-01 00:00:00', NULL),
(5, 5, 0, '', '2025-01-19', '00:00:00', '00:00:00', 46, '0', '', '', '', '', '2024-12-01 00:00:00', NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `t_taikai_offer_member`
--

CREATE TABLE `t_taikai_offer_member` (
  `taikai_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- テーブルの構造 `t_taikai_offer_other`
--

CREATE TABLE `t_taikai_offer_other` (
  `other_id` int(11) NOT NULL,
  `taikai_id` int(11) NOT NULL,
  `name_f` varchar(64) NOT NULL,
  `name_s` varchar(64) NOT NULL,
  `kana_f` varchar(64) NOT NULL,
  `kana_s` varchar(64) NOT NULL,
  `modefied` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `m_area_group`
--
ALTER TABLE `m_area_group`
  ADD PRIMARY KEY (`area_group_id`);

--
-- テーブルのインデックス `m_category`
--
ALTER TABLE `m_category`
  ADD PRIMARY KEY (`category_id`);

--
-- テーブルのインデックス `m_fiscal_year`
--
ALTER TABLE `m_fiscal_year`
  ADD PRIMARY KEY (`fiscal_year_id`);

--
-- テーブルのインデックス `m_grade`
--
ALTER TABLE `m_grade`
  ADD PRIMARY KEY (`grade_id`);

--
-- テーブルのインデックス `m_grade_group`
--
ALTER TABLE `m_grade_group`
  ADD PRIMARY KEY (`grade_group_id`,`grade_id`);

--
-- テーブルのインデックス `m_holder`
--
ALTER TABLE `m_holder`
  ADD PRIMARY KEY (`holder_id`),
  ADD UNIQUE KEY `holder_name` (`holder_name`);

--
-- テーブルのインデックス `m_holder_grade`
--
ALTER TABLE `m_holder_grade`
  ADD PRIMARY KEY (`holder_grade_id`);

--
-- テーブルのインデックス `m_holder_grade_order`
--
ALTER TABLE `m_holder_grade_order`
  ADD PRIMARY KEY (`holder_id`,`grade_id`);

--
-- テーブルのインデックス `m_holder_group`
--
ALTER TABLE `m_holder_group`
  ADD PRIMARY KEY (`holder_group_id`,`holder_id`);

--
-- テーブルのインデックス `m_kaijo`
--
ALTER TABLE `m_kaijo`
  ADD PRIMARY KEY (`kaijo_id`);

--
-- テーブルのインデックス `m_member`
--
ALTER TABLE `m_member`
  ADD PRIMARY KEY (`member_id`);

--
-- テーブルのインデックス `m_menu`
--
ALTER TABLE `m_menu`
  ADD PRIMARY KEY (`menu_id`),
  ADD UNIQUE KEY `controller` (`controller`);

--
-- テーブルのインデックス `m_menu_category`
--
ALTER TABLE `m_menu_category`
  ADD PRIMARY KEY (`menu_id`,`category_id`);

--
-- テーブルのインデックス `m_menu_tab`
--
ALTER TABLE `m_menu_tab`
  ADD PRIMARY KEY (`tab_id`),
  ADD UNIQUE KEY `tab_name` (`tab_name`);

--
-- テーブルのインデックス `m_pref`
--
ALTER TABLE `m_pref`
  ADD PRIMARY KEY (`pref_id`);

--
-- テーブルのインデックス `m_setting`
--
ALTER TABLE `m_setting`
  ADD PRIMARY KEY (`fiscal_year_id`);

--
-- テーブルのインデックス `m_shinsa_class`
--
ALTER TABLE `m_shinsa_class`
  ADD PRIMARY KEY (`shinsa_class_id`);

--
-- テーブルのインデックス `m_shinsa_name`
--
ALTER TABLE `m_shinsa_name`
  ADD PRIMARY KEY (`shinsa_name_id`);

--
-- テーブルのインデックス `m_taikai`
--
ALTER TABLE `m_taikai`
  ADD PRIMARY KEY (`taikai_m_id`);

--
-- テーブルのインデックス `t_member_grade_holder`
--
ALTER TABLE `t_member_grade_holder`
  ADD PRIMARY KEY (`member_id`,`holder_id`,`grade_id`);

--
-- テーブルのインデックス `t_member_regist_fiscal`
--
ALTER TABLE `t_member_regist_fiscal`
  ADD PRIMARY KEY (`fiscal_year_id`,`member_id`);

--
-- テーブルのインデックス `t_monthry_shooting`
--
ALTER TABLE `t_monthry_shooting`
  ADD PRIMARY KEY (`shooting_no`);

--
-- テーブルのインデックス `t_notice_shinsa`
--
ALTER TABLE `t_notice_shinsa`
  ADD PRIMARY KEY (`notice_id`);

--
-- テーブルのインデックス `t_shinsa_member`
--
ALTER TABLE `t_shinsa_member`
  ADD PRIMARY KEY (`shinsa_id`,`member_id`);

--
-- テーブルのインデックス `t_taikai_info`
--
ALTER TABLE `t_taikai_info`
  ADD PRIMARY KEY (`taikai_id`);

--
-- テーブルのインデックス `t_taikai_kasugai`
--
ALTER TABLE `t_taikai_kasugai`
  ADD PRIMARY KEY (`taikai_kasugai_id`);

--
-- テーブルのインデックス `t_taikai_offer_member`
--
ALTER TABLE `t_taikai_offer_member`
  ADD PRIMARY KEY (`taikai_id`,`member_id`);

--
-- テーブルのインデックス `t_taikai_offer_other`
--
ALTER TABLE `t_taikai_offer_other`
  ADD PRIMARY KEY (`other_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `m_area_group`
--
ALTER TABLE `m_area_group`
  MODIFY `area_group_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- テーブルの AUTO_INCREMENT `m_category`
--
ALTER TABLE `m_category`
  MODIFY `category_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- テーブルの AUTO_INCREMENT `m_fiscal_year`
--
ALTER TABLE `m_fiscal_year`
  MODIFY `fiscal_year_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- テーブルの AUTO_INCREMENT `m_holder`
--
ALTER TABLE `m_holder`
  MODIFY `holder_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- テーブルの AUTO_INCREMENT `m_holder_grade`
--
ALTER TABLE `m_holder_grade`
  MODIFY `holder_grade_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- テーブルの AUTO_INCREMENT `m_kaijo`
--
ALTER TABLE `m_kaijo`
  MODIFY `kaijo_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- テーブルの AUTO_INCREMENT `m_member`
--
ALTER TABLE `m_member`
  MODIFY `member_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=132;

--
-- テーブルの AUTO_INCREMENT `m_menu`
--
ALTER TABLE `m_menu`
  MODIFY `menu_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- テーブルの AUTO_INCREMENT `m_taikai`
--
ALTER TABLE `m_taikai`
  MODIFY `taikai_m_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- テーブルの AUTO_INCREMENT `t_notice_shinsa`
--
ALTER TABLE `t_notice_shinsa`
  MODIFY `notice_id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- テーブルの AUTO_INCREMENT `t_taikai_info`
--
ALTER TABLE `t_taikai_info`
  MODIFY `taikai_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- テーブルの AUTO_INCREMENT `t_taikai_kasugai`
--
ALTER TABLE `t_taikai_kasugai`
  MODIFY `taikai_kasugai_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- テーブルの AUTO_INCREMENT `t_taikai_offer_other`
--
ALTER TABLE `t_taikai_offer_other`
  MODIFY `other_id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
